--Скрипт заполняет данные 5 юзеров.
INSERT INTO users (username, email, password) VALUES
('Пользователь1', 'user1@example.com', 'pass1'),
('Пользователь2', 'user2@example.com', 'pass2'),
('Пользователь3', 'user3@example.com', 'pass3'),
('Пользователь4', 'user4@example.com', 'pass4'),
('Пользователь5', 'user5@example.com', 'pass5');


INSERT INTO currencies (code, name, symbol) VALUES
('RUB', 'Российский рубль', '₽'),
('USD', 'Доллар США', '$'),
('EUR', 'Евро', '€');


INSERT INTO user_currencies (user_id, currency_id, exchange_rate) VALUES
(1, 1, 1.0),
(1, 2, 75.0),
(1, 3, 90.0),
(2, 1, 1.0),
(2, 2, 74.5),
(2, 3, 88.0),
(3, 1, 1.0),
(3, 2, 76.0),
(3, 3, 92.0),
(4, 1, 1.0),
(4, 2, 75.5),
(4, 3, 89.0),
(5, 1, 1.0),
(5, 2, 74.8),
(5, 3, 91.0);

INSERT INTO categories (name, type, user_id) VALUES
('Зарплата', 'доход', 1),
('Премия', 'доход', 1),
('Еда', 'расход', 1),
('Транспорт', 'расход', 1),
('Зарплата', 'доход', 2),
('Кафе', 'расход', 2),
('Инвестиции', 'доход', 3),
('Развлечения', 'расход', 3),
('Путешествия', 'расход', 4),
('Подарки', 'расход', 5);

-- Создаем счета
INSERT INTO accounts (name, balance, user_id) VALUES
('Карта Visa', 50000, 1),
('Карта MTS', 15000, 1),
('Карта MasterCard', 30000, 2),
('Карта Сбербанк', 20000, 3),
('Карта Тинькофф', 25000, 4),
('Карта Альфа', 100000, 5);


INSERT INTO tags (name) VALUES
('работа'),
('отдых'),
('еда'),
('путешествие'),
('финансы');

INSERT INTO transactions (amount, date, category_id, account_id, description, type) VALUES
(5000, '2024-04-01', 1, 1, 'Зарплата за март', 'доход'),
(200, '2024-04-02', 3, 1, 'Обед в кафе', 'расход'),
(1500, '2024-04-03', 4, 2, 'Проезд на работу', 'расход'),
(3000, '2024-04-05', 2, 3, 'Премия за проект', 'доход'),
(4000, '2024-04-06', 5, 4, 'Инвестиционный доход', 'доход');

INSERT INTO transaction_tags (transaction_id, tag_id) VALUES
(1, 1),
(2, 3),
(3, 3),
(4, 1),
(5, 5);